# CoolingSetPoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadType..::..CoolingSetPoint Property
HVACLoadType Class See Also
---
The cooling temperature set point in unit Kelvin (K).
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double CoolingSetPoint { get; set; }
```

Visual Basic
---
```text
Public Property CoolingSetPoint As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CoolingSetPoint {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: |

# See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace